Revit 2027 API
OverrideGraphicSettings.CutLinePatternId Property
 ElementId of the cut surface line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CutLinePatternId { get; }
Public ReadOnly Property CutLinePatternId As ElementId
	Get
public:
property ElementId^ CutLinePatternId {
	ElementId^ get ();
}
member CutLinePatternId : ElementId with get
Property Value
ElementId
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace